In [4]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [10]:
lst = ['zayed','ibrahim','khalid']
s = pd.Series(lst, index=[1,2,3])
s

1      zayed
2    ibrahim
3     khalid
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [15]:
s.index = [11,12,13]
s

11      zayed
12    ibrahim
13     khalid
dtype: object

## Q3: Retrieve First and second elements.

In [16]:
s[0:2]

11      zayed
12    ibrahim
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [25]:
s[14]='zayed'
s

11      zayed
12    ibrahim
13     khalid
14      zayed
dtype: object

In [27]:
s.drop_duplicates()

11      zayed
12    ibrahim
13     khalid
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [29]:
students= pd.DataFrame(columns=['ID', 'NAME', 'GPA'])
students

Empty DataFrame
Columns: [ID, NAME, GPA]
Index: []

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [31]:
educ = pd.read_csv('educ_figdp_1_Data.csv')
educ.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [34]:
educ.loc[55:65, ['TIME','Value']]

    TIME Value
55  2007  4.79
56  2008  4.94
57  2009  5.31
58  2010  5.28
59  2011  5.15
60  2000     :
61  2001  4.98
62  2002  5.01
63  2003  5.04
64  2004  4.96
65  2005  4.89

In [35]:
educ[55:65]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
55,2007,Euro area (17 countries),Total public expenditure on education as % of ...,4.79,e
56,2008,Euro area (17 countries),Total public expenditure on education as % of ...,4.94,e
57,2009,Euro area (17 countries),Total public expenditure on education as % of ...,5.31,e
58,2010,Euro area (17 countries),Total public expenditure on education as % of ...,5.28,e
59,2011,Euro area (17 countries),Total public expenditure on education as % of ...,5.15,e
60,2000,Euro area (15 countries),Total public expenditure on education as % of ...,:,u
61,2001,Euro area (15 countries),Total public expenditure on education as % of ...,4.98,s
62,2002,Euro area (15 countries),Total public expenditure on education as % of ...,5.01,e
63,2003,Euro area (15 countries),Total public expenditure on education as % of ...,5.04,e
64,2004,Euro area (15 countries),Total public expenditure on education as % of ...,4.96,e